package org.gof.demo.worldsrv.support.enumKey;

public enum ConfGlobalKey {
	邮箱存储上限(8),
	背包最大容量(30), //
	背包初始格数(31), //
	强化倍数(34), //
	连抽次数(35), //
	连抽折扣(36), //
	冲星最大几星(39), //
	冲星调节成功率的单位(40), //
	扩包花钱类型(41), //
	扩包一格需要的钱数(42), //
	扩包道具SN(43), //
	每日进副本任务次数(44), //
	爬塔刷新buff消耗(50),
	爬塔刷新buff次数(51),
	爬塔每日重置次数(52),
	竞技场每日进入次数(53),
	竞技场刷新消耗(54),
	竞技场每日刷新次数(55),
	竞技场CD时间间隔(56),
	竞技场重置CD消耗(57),
	竞技场开启等级(58),
	竞技场金币奖励(59),
	竞技场钻石奖励(60),
	竞技场演武币奖励(61),
	竞技场奖励系数(62),
	好友列表上限(64),
	好友申请列表上限(65),
	黑名单上限(66),
	竞技场排行榜每页显示人数(69),
	爬塔id5的区间(70),
	爬塔随机对手的间隔范围(71),
	爬塔开启等级(72),
	镜像位置X坐标(73),
	镜像位置Y坐标(74),
	镜像朝向X坐标(75),
	镜像朝向Y坐标(76),
	;

	public final int SN;

	ConfGlobalKey(int sn) {
		this.SN = sn;
	}
}
